 # Pandas

Pandas 데이터 프레임의 장점
- **구조화된 데이터를 효과적으로 처리하고 저장**
- 대용량 데이터를 빠르고 쉽게 다를 수 있다 (한계용량: 엑셀 약 100MB, Pandas DataFrame 1GB~ 100GB)
- 복잡한 기능을 구현하기 쉽다
- 데이터 전처리를 쉽게 할 수 있다
- 다른 시스템(웹 개발, 데이터베이스, 머신러닝 등)과 연동이 쉽다
- Numpy 라이브러리에서 지원하는 수학 및 통계 연산을 그대로 이용할 수 있다. (Numpy를 기반으로 설계했기 때문에!)
- excel, csv 파일을 읽고, 저장할 수 있다.

학습목표
  * *pandas* 라이브러리의 `DataFrame` 및 `Series` 데이터 구조에 학습하기
  * `DataFrame` 및 `Series` 내의 데이터 액세스 및 조작
  *  *pandas* 연산과 함수, 정렬하기
  * *pandas* `DataFrame`으로 csv 등의 데이터 가져오기
  * `DataFrame` 조건으로 검색하기
  * `DataFrame` 함수로 데이터 처리하기
  * `DataFrame` 그룹으로 묶기
  * 멀티인덱스와 피봇테이블

- 판다스 공식 문서 : https://pandas.pydata.org/pandas-docs/stable/index.html#

In [1]:
# Pandas 라이브러리를 pd라는 별칭으로 불러옵니다.
import pandas as pd

 *Pandas*의 기본 데이터 구조는 두 가지 클래스로 구현됩니다.

  * `DataFrame`은 행 및 이름이 지정된 열이 포함된 관계형 데이터 테이블입니다. (-> table)
  * `Series`는 하나의 열입니다. `DataFrame`에는 하나 이상의 `Series`와 각 `Series`의 이름이 포함됩니다. (-> column)

In [2]:
pd.Series(['San Francisco', 'San Jose', 'Sacramento'])

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [3]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
print(s1.values)
print(type(s1.values))

[10 20 30 40 50]
<class 'numpy.ndarray'>

In [6]:
# pandas는 데이터 타입이 섞여도 된다. Numpy는 같은 데이터 타입의 배열만 처리 가능
# 다양한 데이터 타입의 요소를 포함하는 Series를 생성합니다.
s2 = pd.Series(['a','b','c',1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [7]:
print(type(s2[2]))
print(type(s2[4]))

<class 'str'>
<class 'int'>

In [8]:
import numpy as np

s3 = pd.Series([np.nan, 10, 30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [9]:
index_date = ['2025-11-26', '2025-11-27', '2025-11-28', '2025-11-29']
s4 = pd.Series([200, 195, np.nan, 206], index=index_date)
s4

2025-11-26    200.0
2025-11-27    195.0
2025-11-28      NaN
2025-11-29    206.0
dtype: float64

In [10]:
data_dict = {'국어':100, '영어':95, '수학':90}
s5 = pd.Series(data_dict)
s5

국어    100
영어     95
수학     90
dtype: int64

In [11]:
# DataFrame

In [12]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
import numpy as np

data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_data = pd.date_range('2025-11-26', periods=4)
columns = ['A', 'B', 'C']

pd.DataFrame(data=data, index=index_data, columns=columns)

             A   B   C
2025-11-26   1   2   3
2025-11-27   4   5   6
2025-11-28   7   8   9
2025-11-29  10  11  12

In [14]:
# 리스트로 데이터프레임 만들기
table1 = [
    ['2025-11-26', 1000, False, 'gum'],
    ['2025-11-27', 3000, True, 'snack'],
    ['2025-11-28', 2000, True, 'beverage'],
    ['2021-12-09', 1000, True, 'gum']
]

df1 = pd.DataFrame(table1, columns=['일자', '가격', '구매여부', '제품'])
df1

           일자    가격   구매여부        제품
0  2025-11-26  1000  False       gum
1  2025-11-27  3000   True     snack
2  2025-11-28  2000   True  beverage
3  2021-12-09  1000   True       gum

In [15]:
# 딕셔너리
table2 = {
    '일자':['2021-12-06','2021-12-07','2021-12-08','2021-12-09'],
    '가격':[1000,3000,2000,1000],
    '구매여부':['False','True','True','True'],
    '제품': ['gum','snack','beverage','gum']
}

df2 = pd.DataFrame(table2)
df2

           일자    가격   구매여부        제품
0  2021-12-06  1000  False       gum
1  2021-12-07  3000   True     snack
2  2021-12-08  2000   True  beverage
3  2021-12-09  1000   True       gum

In [16]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
df2.values

array([['2021-12-06', 1000, 'False', 'gum'],
       ['2021-12-07', 3000, 'True', 'snack'],
       ['2021-12-08', 2000, 'True', 'beverage'],
       ['2021-12-09', 1000, 'True', 'gum']], dtype=object)

In [18]:
data = {
    'name': ['A','B','C','D'],
    'age': [20,20,23,24],
}

df = pd.DataFrame(data, index=[1,2,3,4])
df

  name  age
1    A   20
2    B   20
3    C   23
4    D   24

In [19]:
data = [
    ['A', 20],
    ['B', 20],
    ['C', 23],
    ['D', 24]
]
columns = ['name', 'age']
index = [1,2,3,4]
df = pd.DataFrame(data=data, columns=columns, index=index )
df

  name  age
1    A   20
2    B   20
3    C   23
4    D   24

#### 데이터 요약 정보 확인하기
* 데이터프레임의 크기 확인: DataFrame 객체.shape
* 데이터프레임의 기본 정보 출력: DataFrame 객체.info()
* 열 데이터 개수 확인: DataFrame.count()
* 열 데이터의 고유값 개수: DataFrame 객체["열 이름"].value_counts()

In [20]:
table1 = [
    ['2025-11-26', 1000, False, 'gum'],
    ['2025-11-27', 3000, True, 'snack'],
    ['2025-11-28', 2000, True, 'beverage'],
    ['2025-12-09', 1000, True, 'gum']
]

df = pd.DataFrame(table1, columns=['일자', '가격', '구매여부', '제품'])
df

           일자    가격   구매여부        제품
0  2025-11-26  1000  False       gum
1  2025-11-27  3000   True     snack
2  2025-11-28  2000   True  beverage
3  2025-12-09  1000   True       gum

In [21]:
df.shape

(4, 4)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일자      4 non-null      object
 1   가격      4 non-null      int64
 2   구매여부    4 non-null      bool
 3   제품      4 non-null      object
dtypes: bool(1), int64(1), object(2)
memory usage: 232.0+ bytes

In [23]:
df.count()

일자      4
가격      4
구매여부    4
제품      4
dtype: int64

In [24]:
df['연도'] = pd.to_datetime(df['일자']).dt.year
df['연도'].value_counts()

연도
2025    4
Name: count, dtype: int64

In [25]:
df

           일자    가격   구매여부        제품    연도
0  2025-11-26  1000  False       gum  2025
1  2025-11-27  3000   True     snack  2025
2  2025-11-28  2000   True  beverage  2025
3  2025-12-09  1000   True       gum  2025

In [26]:
# pandas의 Series()와 DataFrame()으로 생성한 데이터끼리는 사칙 연산이 가능
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])

In [27]:
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [28]:
s1 - s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [29]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [30]:
s2 / s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [31]:
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10,20,30,40,50])

s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [32]:
s3 * s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [33]:
table_data1 = {
    'A': [1,2,3,4,5],
    'B': [10,20,30,40,50],
    'C': [100,200,300,400,500]
}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [34]:
table_data2 = {
    'A': [6,7,8],
    'B': [60,70,80],
    'C': [600,700,800]
}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [35]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [36]:
(df1 + df2).transpose()

       0      1       2   3   4
A    7.0    9.0    11.0 NaN NaN
B   70.0   90.0   110.0 NaN NaN
C  700.0  900.0  1100.0 NaN NaN

In [37]:
# pandas에서 지원하는 통계 분석을 위한 메서드
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [38]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [39]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [40]:
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [41]:
df3.std(axis=0)

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

### 2.3 행 인덱스 변경, 열 이름 변경
* 행 인덱스 변경: DataFrame 객체.rename(index={기존 인덱스:새 인덱스, ...})
* 열 이름 변경: DataFrame 객체.rename(columns={기존 이름:새 이름, ...})

In [42]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                 index = ['준서', '예은'],
                 columns = ['나이', '성별', '학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [43]:
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)  # inplace=True 를 해야지만 원본 데이터가 바뀜
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [44]:
df.rename(index={'준서':'학생1', '예은':'학생2'})

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [45]:
# DataFrame()함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [46]:
df2 = df.copy()
# df2의 '우현' 행(row)을 삭제하고 df3에 저장합니다. inplace=False 이므로 원본 df2는 변경되지 않습니다.
df3 = df2.drop('우현')
df3

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [47]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [48]:
df3 = df2.copy()
df3.drop('인아', inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [49]:
df4 = df.copy()
df4 = df4.drop('수학', axis=1)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [50]:
df.drop(['영어', '음악'], axis=1)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [51]:
df_california = pd.read_csv('./content/sample_data/california_housing_test.csv')
df_california

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23.0,1450.0,642.0,1258.0,607.0,1.1790,225000.0
2996,-118.14,34.06,27.0,5257.0,1082.0,3496.0,1036.0,3.3906,237200.0
2997,-119.70,36.30,10.0,956.0,201.0,693.0,220.0,2.2895,62000.0
2998,-117.12,34.10,40.0,96.0,14.0,46.0,14.0,3.2708,162500.0
2999,-119.63,34.42,42.0,1765.0,263.0,753.0,260.0,8.5608,500001.0

In [52]:
df_california.index

RangeIndex(start=0, stop=3000, step=1)

In [53]:
df_california.index = df_california.index.astype(str)
df_california.index

Index(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
       ...
       '2990', '2991', '2992', '2993', '2994', '2995', '2996', '2997', '2998',
       '2999'],
      dtype='object', length=3000)

In [54]:
df_california.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0

In [55]:
df_california[['longitude', 'latitude']].iloc[10:20]

    longitude  latitude
10    -118.24     33.98
11    -119.12     35.85
12    -121.93     37.25
13    -117.03     32.97
14    -117.97     33.73
15    -117.99     33.81
16    -120.81     37.53
17    -121.20     38.69
18    -118.88     34.21
19    -122.59     38.01

In [56]:
df_california.iloc[10:20][['longitude', 'latitude']]

    longitude  latitude
10    -118.24     33.98
11    -119.12     35.85
12    -121.93     37.25
13    -117.03     32.97
14    -117.97     33.73
15    -117.99     33.81
16    -120.81     37.53
17    -121.20     38.69
18    -118.88     34.21
19    -122.59     38.01

In [57]:
df_california.head(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0

In [58]:
df_california.tail(7)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
2993,-117.91,33.60,37.0,2088.0,510.0,673.0,390.0,5.1048,500001.0
2994,-117.93,33.86,35.0,931.0,181.0,516.0,174.0,5.5867,182500.0
2995,-119.86,34.42,23.0,1450.0,642.0,1258.0,607.0,1.1790,225000.0
2996,-118.14,34.06,27.0,5257.0,1082.0,3496.0,1036.0,3.3906,237200.0
2997,-119.70,36.30,10.0,956.0,201.0,693.0,220.0,2.2895,62000.0
2998,-117.12,34.10,40.0,96.0,14.0,46.0,14.0,3.2708,162500.0
2999,-119.63,34.42,42.0,1765.0,263.0,753.0,260.0,8.5608,500001.0

In [59]:
df_california[1:3]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0

In [60]:
df_california.iloc[1:2]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
1,-118.3,34.26,43.0,1510.0,310.0,809.0,277.0,3.599,176500.0

In [61]:
df_california[df_california.index.isin(['234','456','1567'])]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
234,-122.00,37.35,20.0,4304.0,851.0,2059.0,835.0,5.1674,333000.0
456,-118.20,33.89,37.0,2394.0,568.0,2499.0,551.0,2.5321,105100.0
1567,-122.28,38.00,26.0,2335.0,413.0,980.0,417.0,3.4471,178900.0

In [62]:
df_california.loc[['234','456','1567']]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
234,-122.00,37.35,20.0,4304.0,851.0,2059.0,835.0,5.1674,333000.0
456,-118.20,33.89,37.0,2394.0,568.0,2499.0,551.0,2.5321,105100.0
1567,-122.28,38.00,26.0,2335.0,413.0,980.0,417.0,3.4471,178900.0

In [63]:
df_california.loc[df_california['housing_median_age'] > 50]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
26,-122.42,37.76,52.0,3587.0,1030.0,2259.0,979.0,2.5403,250000.0
36,-122.53,37.97,52.0,1560.0,451.0,700.0,419.0,2.5125,270800.0
70,-121.92,37.33,52.0,2125.0,382.0,930.0,387.0,5.2831,299500.0
99,-118.20,33.77,52.0,1375.0,457.0,1089.0,317.0,2.2344,200000.0
109,-122.43,37.74,52.0,1514.0,314.0,724.0,301.0,5.3292,300900.0
...,...,...,...,...,...,...,...,...,...
2950,-122.42,37.79,52.0,3364.0,1100.0,2112.0,1045.0,2.1343,400000.0
2965,-122.44,37.71,52.0,2711.0,591.0,1848.0,524.0,3.9567,251500.0
2970,-122.47,37.77,52.0,2241.0,443.0,1042.0,377.0,4.1635,398400.0
2972,-118.14,34.17,52.0,2667.0,486.0,1681.0,504.0,4.0524,173100.0
2992,-122.33,37.39,52.0,573.0,102.0,232.0,92.0,6.2263,500001.0

In [64]:
df_california[['total_rooms', 'total_bedrooms']]

      total_rooms  total_bedrooms
0          3885.0           661.0
1          1510.0           310.0
2          3589.0           507.0
3            67.0            15.0
4          1241.0           244.0
...           ...             ...
2995       1450.0           642.0
2996       5257.0          1082.0
2997        956.0           201.0
2998         96.0            14.0
2999       1765.0           263.0

[3000 rows x 2 columns]

In [65]:
df_california['total_bedrooms'][10:20]

10     249.0
11     166.0
12     182.0
13     694.0
14     325.0
15      40.0
16     123.0
17     607.0
18     196.0
19    1307.0
Name: total_bedrooms, dtype: float64

In [66]:
df_california['total_bedrooms']['10':'20']

10     249.0
11     166.0
12     182.0
13     694.0
14     325.0
15      40.0
16     123.0
17     607.0
18     196.0
19    1307.0
20     256.0
Name: total_bedrooms, dtype: float64

In [67]:
df_california.loc['2012', 'total_bedrooms']

np.float64(173.0)

In [68]:
df_california['total_bedrooms']['2012']

np.float64(173.0)

In [69]:
df_california.loc['2012']['total_bedrooms']

np.float64(173.0)

In [70]:
df_california['total_bedrooms'].loc['2012']

np.float64(173.0)

In [71]:
df_california['total_bedrooms'].iloc[2012]

np.float64(173.0)

In [72]:
df_california.iloc[::2][['total_bedrooms', 'total_rooms']]

      total_bedrooms  total_rooms
0              661.0       3885.0
2              507.0       3589.0
4              244.0       1241.0
6              225.0       1009.0
8              617.0       3080.0
...              ...          ...
2990           456.0       1638.0
2992           102.0        573.0
2994           181.0        931.0
2996          1082.0       5257.0
2998            14.0         96.0

[1500 rows x 2 columns]

In [73]:
df_california.T

,0,1,2,3,4,5,6,7,8,9,...,2990,2991,2992,2993,2994,2995,2996,2997,2998,2999
longitude,-122.0500,-118.300,-117.8100,-118.3600,-119.6700,-119.5600,-121.4300,-120.650,-122.8400,-118.0200,...,-118.2300,-117.1700,-122.3300,-117.9100,-117.9300,-119.860,-118.1400,-119.7000,-117.1200,-119.6300
latitude,37.3700,34.260,33.7800,33.8200,36.3300,36.5100,38.6300,35.480,38.4000,34.0800,...,34.0900,34.2800,37.3900,33.6000,33.8600,34.420,34.0600,36.3000,34.1000,34.4200
housing_median_age,27.0000,43.000,27.0000,28.0000,19.0000,37.0000,43.0000,19.000,15.0000,31.0000,...,49.0000,13.0000,52.0000,37.0000,35.0000,23.000,27.0000,10.0000,40.0000,42.0000
total_rooms,3885.0000,1510.000,3589.0000,67.0000,1241.0000,1018.0000,1009.0000,2310.000,3080.0000,2402.0000,...,1638.0000,4867.0000,573.0000,2088.0000,931.0000,1450.000,5257.0000,956.0000,96.0000,1765.0000
total_bedrooms,661.0000,310.000,507.0000,15.0000,244.0000,213.0000,225.0000,471.000,617.0000,632.0000,...,456.0000,718.0000,102.0000,510.0000,181.0000,642.000,1082.0000,201.0000,14.0000,263.0000
population,1537.0000,809.000,1484.0000,49.0000,850.0000,663.0000,604.0000,1341.000,1446.0000,2830.0000,...,1500.0000,780.0000,232.0000,673.0000,516.0000,1258.000,3496.0000,693.0000,46.0000,753.0000
households,606.0000,277.000,495.0000,11.0000,237.0000,204.0000,218.0000,441.000,599.0000,603.0000,...,430.0000,250.0000,92.0000,390.0000,174.0000,607.000,1036.0000,220.0000,14.0000,260.0000
median_income,6.6085,3.599,5.7934,6.1359,2.9375,1.6635,1.6641,3.225,3.6696,2.3333,...,2.6923,7.1997,6.2263,5.1048,5.5867,1.179,3.3906,2.2895,3.2708,8.5608
median_house_value,344700.0000,176500.000,270500.0000,330000.0000,81700.0000,67000.0000,67000.0000,166900.000,194400.0000,164200.0000,...,150000.0000,253800.0000,500001.0000,500001.0000,182500.0000,225000.000,237200.0000,62000.0000,162500.0000,500001.0000

In [74]:
df_california.transpose()

,0,1,2,3,4,5,6,7,8,9,...,2990,2991,2992,2993,2994,2995,2996,2997,2998,2999
longitude,-122.0500,-118.300,-117.8100,-118.3600,-119.6700,-119.5600,-121.4300,-120.650,-122.8400,-118.0200,...,-118.2300,-117.1700,-122.3300,-117.9100,-117.9300,-119.860,-118.1400,-119.7000,-117.1200,-119.6300
latitude,37.3700,34.260,33.7800,33.8200,36.3300,36.5100,38.6300,35.480,38.4000,34.0800,...,34.0900,34.2800,37.3900,33.6000,33.8600,34.420,34.0600,36.3000,34.1000,34.4200
housing_median_age,27.0000,43.000,27.0000,28.0000,19.0000,37.0000,43.0000,19.000,15.0000,31.0000,...,49.0000,13.0000,52.0000,37.0000,35.0000,23.000,27.0000,10.0000,40.0000,42.0000
total_rooms,3885.0000,1510.000,3589.0000,67.0000,1241.0000,1018.0000,1009.0000,2310.000,3080.0000,2402.0000,...,1638.0000,4867.0000,573.0000,2088.0000,931.0000,1450.000,5257.0000,956.0000,96.0000,1765.0000
total_bedrooms,661.0000,310.000,507.0000,15.0000,244.0000,213.0000,225.0000,471.000,617.0000,632.0000,...,456.0000,718.0000,102.0000,510.0000,181.0000,642.000,1082.0000,201.0000,14.0000,263.0000
population,1537.0000,809.000,1484.0000,49.0000,850.0000,663.0000,604.0000,1341.000,1446.0000,2830.0000,...,1500.0000,780.0000,232.0000,673.0000,516.0000,1258.000,3496.0000,693.0000,46.0000,753.0000
households,606.0000,277.000,495.0000,11.0000,237.0000,204.0000,218.0000,441.000,599.0000,603.0000,...,430.0000,250.0000,92.0000,390.0000,174.0000,607.000,1036.0000,220.0000,14.0000,260.0000
median_income,6.6085,3.599,5.7934,6.1359,2.9375,1.6635,1.6641,3.225,3.6696,2.3333,...,2.6923,7.1997,6.2263,5.1048,5.5867,1.179,3.3906,2.2895,3.2708,8.5608
median_house_value,344700.0000,176500.000,270500.0000,330000.0000,81700.0000,67000.0000,67000.0000,166900.000,194400.0000,164200.0000,...,150000.0000,253800.0000,500001.0000,500001.0000,182500.0000,225000.000,237200.0000,62000.0000,162500.0000,500001.0000

In [75]:
df_california.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [76]:
df_california[['longitude', 'housing_median_age', 'latitude']].values

array([[-122.05,   27.  ,   37.37],
       [-118.3 ,   43.  ,   34.26],
       [-117.81,   27.  ,   33.78],
       ...,
       [-119.7 ,   10.  ,   36.3 ],
       [-117.12,   40.  ,   34.1 ],
       [-119.63,   42.  ,   34.42]], shape=(3000, 3))

In [77]:
# 데이터프레임 데이터 수정

In [78]:
dic = {'a':1, 'b':2}
dic
dic['a'] = 3
dic

{'a': 3, 'b': 2}

In [79]:
df_1 = pd.DataFrame([[1,2,3],[4,5,6]], columns=['a','b','c'])
df_1

   a  b  c
0  1  2  3
1  4  5  6

In [80]:
df_1['d'] = pd.Series([7,8])
df_1

   a  b  c  d
0  1  2  3  7
1  4  5  6  8

In [81]:
df_1['a'] = df_1['b']
df_1

   a  b  c  d
0  2  2  3  7
1  5  5  6  8

In [82]:
df_1['a'] += 3
df_1

   a  b  c  d
0  5  2  3  7
1  8  5  6  8

In [83]:
df_1['a'] = df_1['b'] * df_1['d']
df_1

    a  b  c  d
0  14  2  3  7
1  40  5  6  8

In [84]:
df_1.a

0    14
1    40
Name: a, dtype: int64

In [85]:
df_1.b = df_1.a * df_1.c  # 비추천
df_1

    a    b  c  d
0  14   42  3  7
1  40  240  6  8

In [86]:
df_1.drop(['c', 'd'], axis=1)

    a    b
0  14   42
1  40  240

In [87]:
df_1.drop(columns=['c','b'])

    a  d
0  14  7
1  40  8

In [88]:
df_1.drop(index=[0])

    a    b  c  d
1  40  240  6  8

In [89]:
# 데이터 통합하기

2.6 데이터 통합하기
- pd.concat [a, b] : a 아래에 b를 붙이다.
- a append b : a 아래에 b를 붙이다.
- join
- merge

In [90]:
ArbNight = [['알라딘', 26],
            ['자스민', 25]]

cols = ['name', 'age']

df_1 = pd.DataFrame(ArbNight, columns=cols)
df_1

  name  age
0  알라딘   26
1  자스민   25

In [91]:
df_2 = pd.DataFrame([['지니', 3000], ['자파', 50]], columns=['name', 'age'])
df_2

  name   age
0   지니  3000
1   자파    50

In [92]:
df = pd.concat([df_1, df_2], ignore_index=True)
df

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자파    50

In [93]:
df_1._append(df_2, ignore_index=True)

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자파    50

In [94]:
df_3 = pd.DataFrame([['왕', 70], ['장군', 40]], columns=['name','age'])
df_3

  name  age
0    왕   70
1   장군   40

In [95]:
df = pd.concat([df_1, df_2, df_3], ignore_index=True)
df

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자파    50
4    왕    70
5   장군    40

가로 방향으로 통합하기

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html

In [96]:
# 두 개의 DataFrame 데이터를 가로 방향으로 합치기 위해 join()함수 사용합니다.
# 마찬가지로 df1 원본 데이터프레임은 변하지 않습니다.

# 첫 번째 DataFrame을 생성합니다.
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index=index_label)
# 두 번째 DataFrame을 생성합니다.
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

# df1a에 df4a를 인덱스를 기준으로 가로 방향으로 조인합니다.
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [97]:
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

   Class4
0      82
1      92

In [98]:
df1a.join(df5)

   Class1  Class2  Class4
a      95      91     NaN
b      92      93     NaN
c      98      97     NaN
d     100      99     NaN

In [99]:
df5 = pd.DataFrame({'Class4': [82, 92]}, index=['c','d'])
df1a.join(df5)

   Class1  Class2  Class4
a      95      91     NaN
b      92      93     NaN
c      98      97    82.0
d     100      99    92.0

In [100]:
ArbNight = [['알라딘', 26],
            ['자스민', 25]]

cols = ['name', 'age']

df_1 = pd.DataFrame(ArbNight, columns=cols)
df_1

  name  age
0  알라딘   26
1  자스민   25

In [101]:
df_3 = pd.DataFrame([['알라딘', '남자'], ['자스민', '여자']], columns=['name', 'sex'])
df_3

  name sex
0  알라딘  남자
1  자스민  여자

In [102]:
df = df_1.merge(df_3)
df

  name  age sex
0  알라딘   26  남자
1  자스민   25  여자

In [103]:
df_4 = pd.DataFrame([['알라딘', '무직'], ['자스민', '공주']], columns=['name','job'])
df_4

  name job
0  알라딘  무직
1  자스민  공주

In [104]:
df = df.merge(df_4)
df

  name  age sex job
0  알라딘   26  남자  무직
1  자스민   25  여자  공주

In [105]:
df_genie = pd.DataFrame({'name': ['지니'], 'age':[3000], 'sex':['남자'], 'job': ['요정']})
df_genie

  name   age sex job
0   지니  3000  남자  요정

In [106]:
df = pd.concat([df, df_genie], ignore_index=True)
df

  name   age sex job
0  알라딘    26  남자  무직
1  자스민    25  여자  공주
2   지니  3000  남자  요정

In [107]:
df_country = pd.DataFrame({'name':['알라딘', '자스민', '자카'], '국적':['아라비아', '아라비아', '아라비아']})
df_country

  name    국적
0  알라딘  아라비아
1  자스민  아라비아
2   자카  아라비아

- merge(how)

|how 선택| 설명 |
|:-------------------|:---------------------------------------------|
|left|왼쪽 데이터는 모두 선택하고 지정된 열(key)에 값이 있는 오른쪽 데이터를 선택|
|right|오른쪽 데이터는 모두 선택하고 지정된 열(key)에 값이 있는 왼쪽 데이터를 선택|
|outer|지정된 열(key)을 기준으로 왼쪽과 오른쪽 데이터를 모두 선택|
|inner|지정된 열(key)을 기준으로 왼쪽과 오른쪽 데이터 중 공통 항목만 선택(기본값)|

In [108]:
df.merge(df_country, how='left')

  name   age sex job    국적
0  알라딘    26  남자  무직  아라비아
1  자스민    25  여자  공주  아라비아
2   지니  3000  남자  요정   NaN

In [109]:
df.merge(df_country, how='right')

  name   age  sex  job    국적
0  알라딘  26.0   남자   무직  아라비아
1  자스민  25.0   여자   공주  아라비아
2   자카   NaN  NaN  NaN  아라비아

In [110]:
df.merge(df_country, how='outer')

  name     age  sex  job    국적
0  알라딘    26.0   남자   무직  아라비아
1  자스민    25.0   여자   공주  아라비아
2   자카     NaN  NaN  NaN  아라비아
3   지니  3000.0   남자   요정   NaN

In [111]:
df_l = pd.DataFrame({'key': ['A', 'B', 'C'], 'left': [1,2,3]})
df_l

  key  left
0   A     1
1   B     2
2   C     3

In [112]:
df_r = pd.DataFrame({'key': ['A', 'B', 'D'], 'right': [4,5,6]})
df_r

  key  right
0   A      4
1   B      5
2   D      6

In [113]:
df = df_l.merge(df_r, how='right', on='key')
df

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [114]:
df_l['data'] = ['1000','2000','3000']
df_l

  key  left  data
0   A     1  1000
1   B     2  2000
2   C     3  3000

In [115]:
df_r['data'] = ['a','b','c']
df_r

  key  right data
0   A      4    a
1   B      5    b
2   D      6    c

In [116]:
df_l.merge(df_r, how='outer', on='key')

  key  left data_x  right data_y
0   A   1.0   1000    4.0      a
1   B   2.0   2000    5.0      b
2   C   3.0   3000    NaN    NaN
3   D   NaN    NaN    6.0      c

In [117]:
df_l.merge(df_r, how='outer', on='data')

  key_x  left  data key_y  right
0     A   1.0  1000   NaN    NaN
1     B   2.0  2000   NaN    NaN
2     C   3.0  3000   NaN    NaN
3   NaN   NaN     a     A    4.0
4   NaN   NaN     b     B    5.0
5   NaN   NaN     c     D    6.0

In [118]:
df_l.merge(df_r, how='outer')

  key  left  data  right
0   A   1.0  1000    NaN
1   A   NaN     a    4.0
2   B   2.0  2000    NaN
3   B   NaN     b    5.0
4   C   3.0  3000    NaN
5   D   NaN     c    6.0

In [119]:
df_l

  key  left  data
0   A     1  1000
1   B     2  2000
2   C     3  3000

In [120]:
df_r

  key  right data
0   A      4    a
1   B      5    b
2   D      6    c

In [121]:
pd.concat([df_l, df_r], axis=1)

  key  left  data key  right data
0   A     1  1000   A      4    a
1   B     2  2000   B      5    b
2   C     3  3000   D      6    c

2.7 Pandas 연산과 함수

##### 누락된 데이터 체크(결측치 처리)
- 현실의 데이터들은 일부가 누락된 경우가 굉장히 많아서, 반드시 미리 확인해야함

In [122]:
# 리스트로 데이터프레임 만들기
# DataFrame을 위한 데이터를 정의합니다.
table1 = [
    ['2021-12-06', 1000, 'False', 'gum'],
    ['2021-12-07', 3000, 'True', 'snack'],
    ['2021-12-08', 2000, 'True', 'beverage'],
    ['2021-12-09', 1000, 'True', 'gum']
]
# 컬럼 이름을 지정하여 DataFrame을 생성합니다.
df = pd.DataFrame(table1, columns = ['일자','가격','구매여부','제품'])
df

           일자    가격   구매여부        제품
0  2021-12-06  1000  False       gum
1  2021-12-07  3000   True     snack
2  2021-12-08  2000   True  beverage
3  2021-12-09  1000   True       gum

In [123]:
# '신제품여부'라는 새로운 컬럼을 추가하고 값을 할당합니다. 마지막 값은 None(결측치)입니다.
df['신제품여부'] = [True, True, False, None]
df

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage  False
3  2021-12-09  1000   True       gum   None

In [124]:
df.isnull()

      일자     가격   구매여부     제품  신제품여부
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False   True

In [125]:
df.notnull()

     일자    가격  구매여부    제품  신제품여부
0  True  True  True  True   True
1  True  True  True  True   True
2  True  True  True  True   True
3  True  True  True  True  False

In [126]:
df.dropna()

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage  False

In [127]:
df['신제품여부'] = df['신제품여부'].fillna('모름')
df

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage  False
3  2021-12-09  1000   True       gum     모름

In [128]:
df['신제품여부'] = [True, True, None, False]
df

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage   None
3  2021-12-09  1000   True       gum  False

In [129]:
df['신제품여부'] = df['신제품여부'].fillna(method = 'ffill')
df

C:\Users\amy\AppData\Local\Temp\ipykernel_40384\584318286.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['신제품여부'] = df['신제품여부'].fillna(method = 'ffill')
C:\Users\amy\AppData\Local\Temp\ipykernel_40384\584318286.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['신제품여부'] = df['신제품여부'].fillna(method = 'ffill')

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage   True
3  2021-12-09  1000   True       gum  False

In [130]:
df['신제품여부'] = df['신제품여부'].fillna(method = 'bfill')
df

C:\Users\amy\AppData\Local\Temp\ipykernel_40384\1169615263.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['신제품여부'] = df['신제품여부'].fillna(method = 'bfill')

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage   True
3  2021-12-09  1000   True       gum  False

In [131]:
df.sort_values('가격')

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
3  2021-12-09  1000   True       gum  False
2  2021-12-08  2000   True  beverage   True
1  2021-12-07  3000   True     snack   True

In [132]:
df.sort_values('가격', ascending=False)

           일자    가격   구매여부        제품  신제품여부
1  2021-12-07  3000   True     snack   True
2  2021-12-08  2000   True  beverage   True
0  2021-12-06  1000  False       gum   True
3  2021-12-09  1000   True       gum  False

In [133]:
df.sort_values(['가격', '제품'])

           일자    가격   구매여부        제품  신제품여부
0  2021-12-06  1000  False       gum   True
3  2021-12-09  1000   True       gum  False
2  2021-12-08  2000   True  beverage   True
1  2021-12-07  3000   True     snack   True

In [134]:
df['제품'].unique()

array(['gum', 'snack', 'beverage'], dtype=object)

In [135]:
df['제품'].value_counts()

제품
gum         2
snack       1
beverage    1
Name: count, dtype: int64

#### 표 형식의 데이터 파일을 읽기

In [136]:
%%writefile ./sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing ./sea_rain1.csv

In [140]:
pd.read_csv('./content/sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [143]:
%%writefile ./sea_rain1_space.txt
# 텍스트 파일 'sea_rain1_space.txt'를 생성하고 공백으로 구분된 데이터를 작성합니다.
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing ./sea_rain1_space.txt

In [144]:
pd.read_csv('./content/sea_rain1_space.txt', sep=' ', skiprows=1)

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [145]:
pd.read_csv('./content/sea_rain1.csv', index_col='연도')

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [146]:
df_WH = pd.DataFrame({'w': [63, 64, 76, 43],
                      'h': [160, 146, 180, 178]},
                     index=['id1','id2','id3','id4'])
df_WH.index.name = 'User'
df_WH

       w    h
User
id1   63  160
id2   64  146
id3   76  180
id4   43  178

In [147]:
df_WH.to_csv('./saveDataFrame.csv')  # csv 파일 형태로 저장

In [148]:
df_WH.to_csv('./saveDAtaFrame1.txt')  # 콤마로 구분된 텍스트 파일로 저장